#+title: Strings
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> <stdlib.h> <string.h> <time.h> :results output :exports both :comments none :noweb yes
** Exercise 11: Pointer Arithmetic in Strings

- *Problem*: Modify the =count_spaces= function to use pointer arithmetic
  instead of array indexing.
  
- *Solution*:
  #+begin_src C
    #include <stdio.h>

    int count_spaces(const char *s) {
      int count = 0;
      // ...
      return count;
    }

    int main() {
      char str[] = "Can you count spaces?";
      printf("Spaces in \"%s\" = %d\n", str, count_spaces(str));
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Spaces in "Can you count spaces?" = 0

